## [Portal GitOps Resources](https://ziggy.app.us.spacelift.io/stack/portal-gitops-resources/run/01KMF0DJTDWM3G1PVSKEG0D08G) plan logs

<details>
<summary>Click here to expand</summary>

```
...
                          + storeRef     = {
                              + kind = (known after apply)
                              + name = (known after apply)
                            }
                        }
                    },
                ]
              + dataFrom        = (known after apply)
              + refreshInterval = "1h0m0s"
              + refreshPolicy   = (known after apply)
              + secretStoreRef  = {
                  + kind = "ClusterSecretStore"
                  + name = "liferay-portal-poc-secret-store"
                }
              + target          = {
                  + creationPolicy = "Owner"
                  + deletionPolicy = (known after apply)
                  + immutable      = (known after apply)
                  + manifest       = {
                      + apiVersion = (known after apply)
                      + kind       = (known after apply)
                    }
                  + name           = "gitops-credentials"
                  + template       = {
                      + data          = {
                          + name     = "git-repo-liferay"
                          + password = "{{ .password }}"
                          + type     = "git"
                          + url      = "https://github.com/allen-ziegenfus/liferay-portal.git"
                          + username = "{{ .username }}"
                        }
                      + engineVersion = (known after apply)
                      + mergePolicy   = (known after apply)
                      + metadata      = {
                          + annotations = (known after apply)
                          + finalizers  = (known after apply)
                          + labels      = {
                              + "app.kubernetes.io/component"    = "gitops-infrastructure"
                              + "app.kubernetes.io/managed-by"   = "liferay-cloud-native-terraform"
                              + "app.kubernetes.io/name"         = "gitops-credentials"
                              + "app.kubernetes.io/part-of"      = "liferay-gitops"
                              + "argocd.argoproj.io/secret-type" = "repository"
                              + environment                      = "internal"
                              + "liferay.com/project"            = "liferay-cloud-native"
                            }
                        }
                      + templateFrom  = (known after apply)
                      + type          = "Opaque"
                    }
                }
            }
        }

      + field_manager {
          + force_conflicts = true
          + name            = "liferay-cloud-native-terraform"
        }
    }

  # kubernetes_manifest.secret_store will be created
  + resource "kubernetes_manifest" "secret_store" {
      + manifest = {
          + apiVersion = "external-secrets.io/v1"
          + kind       = "ClusterSecretStore"
          + metadata   = {
              + labels = {
                  + "app.kubernetes.io/component"  = "gitops-infrastructure"
                  + "app.kubernetes.io/managed-by" = "liferay-cloud-native-terraform"
                  + "app.kubernetes.io/name"       = "liferay-portal-poc-secret-store"
                  + "app.kubernetes.io/part-of"    = "liferay-gitops"
                  + environment                    = "internal"
                  + "liferay.com/project"          = "liferay-cloud-native"
                }
              + name   = "liferay-portal-poc-secret-store"
            }
          + spec       = {
              + provider = {
                  + gcpsm = {
                      + projectID = "cne-development"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "external-secrets.io/v1"
          + kind       = "ClusterSecretStore"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "liferay-portal-poc-secret-store"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + conditions      = (known after apply)
              + controller      = (known after apply)
              + provider        = {
                  + akeyless                 = {
                      + akeylessGWApiURL = (known after apply)
                      + authSecretRef    = {
                          + kubernetesAuth = {
                              + accessID          = (known after apply)
                              + k8sConfName       = (known after apply)
                              + secretRef         = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + serviceAccountRef = {
                                  + audiences = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + secretRef      = {
                              + accessID        = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + accessType      = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + accessTypeParam = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + caBundle         = (known after apply)
                      + caProvider       = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                          + type      = (known after apply)
                        }
                    }
                  + alibaba                  = {
                      + auth     = {
                          + rrsa      = {
                              + oidcProviderArn   = (known after apply)
                              + oidcTokenFilePath = (known after apply)
                              + roleArn           = (known after apply)
                              + sessionName       = (known after apply)
                            }
                          + secretRef = {
                              + accessKeyIDSecretRef     = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + accessKeySecretSecretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + regionID = (known after apply)
                    }
                  + aws                      = {
                      + additionalRoles   = (known after apply)
                      + auth              = {
                          + jwt       = {
                              + serviceAccountRef = {
                                  + audiences = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + secretRef = {
                              + accessKeyIDSecretRef     = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + secretAccessKeySecretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + sessionTokenSecretRef    = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + externalID        = (known after apply)
                      + prefix            = (known after apply)
                      + region            = (known after apply)
                      + role              = (known after apply)
                      + secretsManager    = {
                          + forceDeleteWithoutRecovery = (known after apply)
                          + recoveryWindowInDays       = (known after apply)
                        }
                      + service           = (known after apply)
                      + sessionTags       = (known after apply)
                      + transitiveTagKeys = (known after apply)
                    }
                  + azurekv                  = {
                      + authSecretRef     = {
                          + clientCertificate = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + clientId          = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + clientSecret      = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + tenantId          = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + authType          = (known after apply)
                      + customCloudConfig = {
                          + activeDirectoryEndpoint = (known after apply)
                          + keyVaultDNSSuffix       = (known after apply)
                          + keyVaultEndpoint        = (known after apply)
                          + resourceManagerEndpoint = (known after apply)
                        }
                      + environmentType   = (known after apply)
                      + identityId        = (known after apply)
                      + serviceAccountRef = {
                          + audiences = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + tenantId          = (known after apply)
                      + useAzureSDK       = (known after apply)
                      + vaultUrl          = (known after apply)
                    }
                  + beyondtrust              = {
                      + auth   = {
                          + apiKey         = {
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + value     = (known after apply)
                            }
                          + certificate    = {
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + value     = (known after apply)
                            }
                          + certificateKey = {
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + value     = (known after apply)
                            }
                          + clientId       = {
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + value     = (known after apply)
                            }
                          + clientSecret   = {
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + value     = (known after apply)
                            }
                        }
                      + server = {
                          + apiUrl               = (known after apply)
                          + apiVersion           = (known after apply)
                          + clientTimeOutSeconds = (known after apply)
                          + retrievalType        = (known after apply)
                          + separator            = (known after apply)
                          + verifyCA             = (known after apply)
                        }
                    }
                  + bitwardensecretsmanager  = {
                      + apiURL                = (known after apply)
                      + auth                  = {
                          + secretRef = {
                              + credentials = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + bitwardenServerSDKURL = (known after apply)
                      + caBundle              = (known after apply)
                      + caProvider            = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                          + type      = (known after apply)
                        }
                      + identityURL           = (known after apply)
                      + organizationID        = (known after apply)
                      + projectID             = (known after apply)
                    }
                  + chef                     = {
                      + auth      = {
                          + secretRef = {
                              + privateKeySecretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + serverUrl = (known after apply)
                      + username  = (known after apply)
                    }
                  + cloudrusm                = {
                      + auth      = {
                          + secretRef = {
                              + accessKeyIDSecretRef     = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + accessKeySecretSecretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + projectID = (known after apply)
                    }
                  + conjur                   = {
                      + auth       = {
                          + apikey = {
                              + account   = (known after apply)
                              + apiKeyRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + userRef   = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + jwt    = {
                              + account           = (known after apply)
                              + hostId            = (known after apply)
                              + secretRef         = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + serviceAccountRef = {
                                  + audiences = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + serviceID         = (known after apply)
                            }
                        }
                      + caBundle   = (known after apply)
                      + caProvider = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                          + type      = (known after apply)
                        }
                      + url        = (known after apply)
                    }
                  + delinea                  = {
                      + clientId     = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + value     = (known after apply)
                        }
                      + clientSecret = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + value     = (known after apply)
                        }
                      + tenant       = (known after apply)
                      + tld          = (known after apply)
                      + urlTemplate  = (known after apply)
                    }
                  + device42                 = {
                      + auth = {
                          + secretRef = {
                              + credentials = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + host = (known after apply)
                    }
                  + doppler                  = {
                      + auth            = {
                          + secretRef = {
                              + dopplerToken = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + config          = (known after apply)
                      + format          = (known after apply)
                      + nameTransformer = (known after apply)
                      + project         = (known after apply)
                    }
                  + fake                     = {
                      + data             = (known after apply)
                      + validationResult = (known after apply)
                    }
                  + fortanix                 = {
                      + apiKey = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + apiUrl = (known after apply)
                    }
                  + gcpsm                    = {
                      + auth                         = {
                          + secretRef                  = {
                              + secretAccessKeySecretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + workloadIdentity           = {
                              + clusterLocation   = (known after apply)
                              + clusterName       = (known after apply)
                              + clusterProjectID  = (known after apply)
                              + serviceAccountRef = {
                                  + audiences = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + workloadIdentityFederation = {
                              + audience               = (known after apply)
                              + awsSecurityCredentials = {
                                  + awsCredentialsSecretRef = {
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                    }
                                  + region                  = (known after apply)
                                }
                              + credConfig             = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + externalTokenEndpoint  = (known after apply)
                              + serviceAccountRef      = {
                                  + audiences = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + location                     = (known after apply)
                      + projectID                    = "cne-development"
                      + secretVersionSelectionPolicy = (known after apply)
                    }
                  + github                   = {
                      + appID          = (known after apply)
                      + auth           = {
                          + privateKey = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + environment    = (known after apply)
                      + installationID = (known after apply)
                      + organization   = (known after apply)
                      + repository     = (known after apply)
                      + uploadURL      = (known after apply)
                      + url            = (known after apply)
                    }
                  + gitlab                   = {
                      + auth              = {
                          + SecretRef = {
                              + accessToken = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + caBundle          = (known after apply)
                      + caProvider        = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                          + type      = (known after apply)
                        }
                      + environment       = (known after apply)
                      + groupIDs          = (known after apply)
                      + inheritFromGroups = (known after apply)
                      + projectID         = (known after apply)
                      + url               = (known after apply)
                    }
                  + ibm                      = {
                      + auth       = {
                          + containerAuth = {
                              + iamEndpoint   = (known after apply)
                              + profile       = (known after apply)
                              + tokenLocation = (known after apply)
                            }
                          + secretRef     = {
                              + secretApiKeySecretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + serviceUrl = (known after apply)
                    }
                  + infisical                = {
                      + auth         = {
                          + awsAuthCredentials        = {
                              + identityId = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + azureAuthCredentials      = {
                              + identityId = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + resource   = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + gcpIamAuthCredentials     = {
                              + identityId                = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + serviceAccountKeyFilePath = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + gcpIdTokenAuthCredentials = {
                              + identityId = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + jwtAuthCredentials        = {
                              + identityId = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + jwt        = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + kubernetesAuthCredentials = {
                              + identityId              = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + serviceAccountTokenPath = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + ldapAuthCredentials       = {
                              + identityId   = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + ldapPassword = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + ldapUsername = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + ociAuthCredentials        = {
                              + fingerprint          = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + identityId           = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + privateKey           = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + privateKeyPassphrase = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + region               = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + tenancyId            = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + userId               = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + tokenAuthCredentials      = {
                              + accessToken = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + universalAuthCredentials  = {
                              + clientId     = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + clientSecret = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + hostAPI      = (known after apply)
                      + secretsScope = {
                          + environmentSlug        = (known after apply)
                          + expandSecretReferences = (known after apply)
                          + projectSlug            = (known after apply)
                          + recursive              = (known after apply)
                          + secretsPath            = (known after apply)
                        }
                    }
                  + keepersecurity           = {
                      + authRef  = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + folderID = (known after apply)
                    }
                  + kubernetes               = {
                      + auth            = {
                          + cert           = {
                              + clientCert = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + clientKey  = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + serviceAccount = {
                              + audiences = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + token          = {
                              + bearerToken = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + authRef         = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + remoteNamespace = (known after apply)
                      + server          = {
                          + caBundle   = (known after apply)
                          + caProvider = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                              + type      = (known after apply)
                            }
                          + url        = (known after apply)
                        }
                    }
                  + ngrok                    = {
                      + apiUrl = (known after apply)
                      + auth   = {
                          + apiKey = {
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + vault  = {
                          + name = (known after apply)
                        }
                    }
                  + onboardbase              = {
                      + apiHost     = (known after apply)
                      + auth        = {
                          + apiKeyRef   = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + passcodeRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + environment = (known after apply)
                      + project     = (known after apply)
                    }
                  + onepassword              = {
                      + auth        = {
                          + secretRef = {
                              + connectTokenSecretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + connectHost = (known after apply)
                      + vaults      = (known after apply)
                    }
                  + onepasswordSDK           = {
                      + auth            = {
                          + serviceAccountSecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + integrationInfo = {
                          + name    = (known after apply)
                          + version = (known after apply)
                        }
                      + vault           = (known after apply)
                    }
                  + oracle                   = {
                      + auth              = {
                          + secretRef = {
                              + fingerprint = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + privatekey  = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + tenancy   = (known after apply)
                          + user      = (known after apply)
                        }
                      + compartment       = (known after apply)
                      + encryptionKey     = (known after apply)
                      + principalType     = (known after apply)
                      + region            = (known after apply)
                      + serviceAccountRef = {
                          + audiences = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + vault             = (known after apply)
                    }
                  + passbolt                 = {
                      + auth = {
                          + passwordSecretRef   = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + privateKeySecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + host = (known after apply)
                    }
                  + passworddepot            = {
                      + auth     = {
                          + secretRef = {
                              + credentials = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + database = (known after apply)
                      + host     = (known after apply)
                    }
                  + previder                 = {
                      + auth    = {
                          + secretRef = {
                              + accessToken = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + baseUri = (known after apply)
                    }
                  + pulumi                   = {
                      + accessToken  = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + apiUrl       = (known after apply)
                      + environment  = (known after apply)
                      + organization = (known after apply)
                      + project      = (known after apply)
                    }
                  + scaleway                 = {
                      + accessKey = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + value     = (known after apply)
                        }
                      + apiUrl    = (known after apply)
                      + projectId = (known after apply)
                      + region    = (known after apply)
                      + secretKey = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + value     = (known after apply)
                        }
                    }
                  + secretserver             = {
                      + domain    = (known after apply)
                      + password  = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + value     = (known after apply)
                        }
                      + serverURL = (known after apply)
                      + username  = {
                          + secretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + value     = (known after apply)
                        }
                    }
                  + senhasegura              = {
                      + auth                 = {
                          + clientId              = (known after apply)
                          + clientSecretSecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + ignoreSslCertificate = (known after apply)
                      + module               = (known after apply)
                      + url                  = (known after apply)
                    }
                  + vault                    = {
                      + auth                = {
                          + appRole        = {
                              + path      = (known after apply)
                              + roleId    = (known after apply)
                              + roleRef   = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + cert           = {
                              + clientCert = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + path       = (known after apply)
                              + secretRef  = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + iam            = {
                              + externalID          = (known after apply)
                              + jwt                 = {
                                  + serviceAccountRef = {
                                      + audiences = (known after apply)
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                    }
                                }
                              + path                = (known after apply)
                              + region              = (known after apply)
                              + role                = (known after apply)
                              + secretRef           = {
                                  + accessKeyIDSecretRef     = {
                                      + key       = (known after apply)
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                    }
                                  + secretAccessKeySecretRef = {
                                      + key       = (known after apply)
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                    }
                                  + sessionTokenSecretRef    = {
                                      + key       = (known after apply)
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                    }
                                }
                              + vaultAwsIamServerID = (known after apply)
                              + vaultRole           = (known after apply)
                            }
                          + jwt            = {
                              + kubernetesServiceAccountToken = {
                                  + audiences         = (known after apply)
                                  + expirationSeconds = (known after apply)
                                  + serviceAccountRef = {
                                      + audiences = (known after apply)
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                    }
                                }
                              + path                          = (known after apply)
                              + role                          = (known after apply)
                              + secretRef                     = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + kubernetes     = {
                              + mountPath         = (known after apply)
                              + role              = (known after apply)
                              + secretRef         = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + serviceAccountRef = {
                                  + audiences = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                          + ldap           = {
                              + path      = (known after apply)
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + username  = (known after apply)
                            }
                          + namespace      = (known after apply)
                          + tokenSecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + userPass       = {
                              + path      = (known after apply)
                              + secretRef = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + username  = (known after apply)
                            }
                        }
                      + caBundle            = (known after apply)
                      + caProvider          = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                          + type      = (known after apply)
                        }
                      + checkAndSet         = {
                          + required = (known after apply)
                        }
                      + forwardInconsistent = (known after apply)
                      + headers             = (known after apply)
                      + namespace           = (known after apply)
                      + path                = (known after apply)
                      + readYourWrites      = (known after apply)
                      + server              = (known after apply)
                      + tls                 = {
                          + certSecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                          + keySecretRef  = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + version             = (known after apply)
                    }
                  + volcengine               = {
                      + auth   = {
                          + secretRef = {
                              + accessKeyID     = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + secretAccessKey = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + token           = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + region = (known after apply)
                    }
                  + webhook                  = {
                      + auth       = {
                          + ntlm = {
                              + passwordSecret = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                              + usernameSecret = {
                                  + key       = (known after apply)
                                  + name      = (known after apply)
                                  + namespace = (known after apply)
                                }
                            }
                        }
                      + body       = (known after apply)
                      + caBundle   = (known after apply)
                      + caProvider = {
                          + key       = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                          + type      = (known after apply)
                        }
                      + headers    = (known after apply)
                      + method     = (known after apply)
                      + result     = {
                          + jsonPath = (known after apply)
                        }
                      + secrets    = (known after apply)
                      + timeout    = (known after apply)
                      + url        = (known after apply)
                    }
                  + yandexcertificatemanager = {
                      + apiEndpoint = (known after apply)
                      + auth        = {
                          + authorizedKeySecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + caProvider  = {
                          + certSecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + fetching    = {
                          + byID   = (known after apply)
                          + byName = {
                              + folderID = (known after apply)
                            }
                        }
                    }
                  + yandexlockbox            = {
                      + apiEndpoint = (known after apply)
                      + auth        = {
                          + authorizedKeySecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + caProvider  = {
                          + certSecretRef = {
                              + key       = (known after apply)
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }
                      + fetching    = {
                          + byID   = (known after apply)
                          + byName = {
                              + folderID = (known after apply)
                            }
                        }
                    }
                }
              + refreshInterval = (known after apply)
              + retrySettings   = {
                  + maxRetries    = (known after apply)
                  + retryInterval = (known after apply)
                }
            }
        }

      + field_manager {
          + force_conflicts = true
          + name            = "liferay-cloud-native-terraform"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

[01KMEMTZZPBDCTX6M6QTZ80BCE] Changes are GO
[01KMEMTZZPBDCTX6M6QTZ80BCE] Generating JSON representation of the plan...
[01KMEMTZZPBDCTX6M6QTZ80BCE] JSON representation is GO
[01KMEMTZZPBDCTX6M6QTZ80BCE] Generating Infracost JSON report from plan

[01KMEMTZZPBDCTX6M6QTZ80BCE] Infracost report generated successfully
[01KMEMTZZPBDCTX6M6QTZ80BCE] Uploading the list of managed resources...
[01KMEMTZZPBDCTX6M6QTZ80BCE] Infracost report found from previous steps
[01KMEMTZZPBDCTX6M6QTZ80BCE] Mapping Infracost data to resources
[01KMEMTZZPBDCTX6M6QTZ80BCE] Costs mapped successfully
[01KMEMTZZPBDCTX6M6QTZ80BCE] Please be aware that the run changes calculation includes output changes.
[01KMEMTZZPBDCTX6M6QTZ80BCE] Resource list upload is GO
[01KMEMTZZPBDCTX6M6QTZ80BCE] Loading custom plan policy inputs...
[01KMEMTZZPBDCTX6M6QTZ80BCE] 4 custom plan policy inputs found: checkov, infracost, tflint, trivy
[01KMEMTZZPBDCTX6M6QTZ80BCE] Evaluated 6 plan policies
[01KMEMTZZPBDCTX6M6QTZ80BCE] Plan policy warning: 

🛠️ SECURITY & COST SUMMARY

💰 Cost Estimate: Total Monthly: $0 (Change: $0)

🛡️ Checkov: PASS (0 Failed Checks)

🛡️ Trivy: PASS (0 Findings)

🔍 TFLint: PASS (0 Issues)

🐽 TruffleHog: No data available.


[01KMEMTZZPBDCTX6M6QTZ80BCE] Plan checks are GO
```

</details>